'''Задание 3. If3. Дано целое число. Если оно является положительным, то вычесть из него 8; если отрицательным, то прибавить к нему 6; если нулевым, то заменить его на 10. Вывести полученное число. Абросимова Лада 24ИС'''
a = int(input())
if a >= 0:
    print (a-8)
elif:
    print (a+6)
else:
    a = 10
    print (a)
